app/controllers/servers_controller.rb

  def game_view
    # Ensure the user is registered to this server
    unless current_user.servers.include?(@server)
---
SELECT 1 AS one FROM "servers" INNER JOIN "user_servers" ON "servers"."id" = "user_servers"."server_id" WHERE "user_servers"."user_id" = ? AND "servers"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def index
    @user_servers = current_user.user_servers.includes(:server) # Registered servers
---
SELECT "user_servers".* FROM "user_servers" WHERE "user_servers"."user_id" = ?  [["user_id", 1]]

  def create
    server = Server.new(status: "New Server") # Adjust fields as needed
    if server.save
---
INSERT INTO "user_servers" ("user_id", "server_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id", "registered_at"  [["user_id", 1], ["server_id", 4], ["created_at", "2024-11-28 00:11:29.439150"], ["updated_at", "2024-11-28 00:11:29.439150"]]

  def add_user_custom
    server = Server.find_by(id: params[:server_number])
    if server
      registration = UserServer.find_or_initialize_by(user: current_user, server: server)
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_servers".* FROM "user_servers" WHERE "user_servers"."user_id" = ? AND "user_servers"."server_id" = ? LIMIT ?  [["user_id", 1], ["server_id", 1], ["LIMIT", 1]]

  def add_user
    server = Server.find(params[:id]) # Find the server by ID
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_server
    @server = Server.find(params[:id])
---
SELECT "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]