app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "therealdonaldtrump@usa.com"]]
---
  def create
      # Real user authentication
      user = User.find_by(email: params[:email])